In [64]:
# Importara a Biblioteca
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
import numpy as np
import random as rnd

In [91]:
# Leia o dataset de traino e teste
train_data = pd.read_csv('train.csv')
test_data = pd.read_csv('test.csv')

In [66]:
print(train_data.shape)
print(test_data.shape)

(891, 12)
(418, 11)

In [67]:
train_data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [68]:
test_data.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [97]:
train_x = train_data.drop(columns=['Survived'],axis=1)
train_y = train_data['Survived']

In [70]:
train_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [71]:
test_data.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [72]:
test_data = 'test.csv'
colunas = ['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived']
test_dataset = pd.read_csv(test_data, names=colunas)
array = test_dataset.values
test_dataset.head()

   PassengerId  Pclass  ...  Embarked Survived
0  PassengerId  Pclass  ...  Embarked      NaN
1          892       3  ...         Q      NaN
2          893       3  ...         S      NaN
3          894       2  ...         Q      NaN
4          895       3  ...         S      NaN

[5 rows x 12 columns]

In [73]:
test_dataset.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
Survived       419
dtype: int64

In [75]:
test_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 419 entries, 0 to 418
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  419 non-null    object
 1   Pclass       419 non-null    object
 2   Name         419 non-null    object
 3   Sex          419 non-null    object
 4   Age          333 non-null    object
 5   SibSp        419 non-null    object
 6   Parch        419 non-null    object
 7   Ticket       419 non-null    object
 8   Fare         418 non-null    object
 9   Cabin        92 non-null     object
 10  Embarked     419 non-null    object
 11  Survived     0 non-null      float64
dtypes: float64(1), object(11)
memory usage: 39.4+ KB

In [76]:
test_dataset.dtypes

PassengerId     object
Pclass          object
Name            object
Sex             object
Age             object
SibSp           object
Parch           object
Ticket          object
Fare            object
Cabin           object
Embarked        object
Survived       float64
dtype: object

In [77]:
test_dataset.dropna(inplace= True)

In [78]:
test_dataset.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
Survived       0
dtype: int64

In [80]:
test_dataset.head(100)

Empty DataFrame
Columns: [PassengerId, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Survived]
Index: []

In [81]:
test_dataset.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [82]:
test_x = test_dataset.drop(['Survived'],axis=1)
test_y = test_dataset['Survived']

In [83]:
model = DecisionTreeClassifier
# (max_depth+5)

In [84]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [104]:
train_data.dropna(inplace= True)

In [105]:
train_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [107]:
train_data.shape
# (891, 12)

(183, 12)

In [112]:
train_data.dropna(inplace= True)
train_data.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
3             4         1       1  ...  53.1000  C123         S
6             7         0       1  ...  51.8625   E46         S
10           11         1       3  ...  16.7000    G6         S
11           12         1       1  ...  26.5500  C103         S

[5 rows x 12 columns]

In [113]:
model.fit(train_x,train_y)

TypeError: ignored

In [61]:
print('Depth of the Decision Tree:', model.get_depth)

Depth of the Decision Tree: <function BaseDecisionTree.get_depth at 0x7ff808d48b00>

In [63]:
predict_train = model.predict(train_x)
print('Target on train data', predict_train)

TypeError: ignored

In [ ]:
accuracy_train = accuracy_score(train_y, predict_train)
print('accuracy_score train dataset;', accuracy_train)

In [ ]:
predict_test = model.predict(test_X)
print('Target on test data', predict_test)

In [ ]:
accuracy_test = accuracy_score(test_y, predict_test)
print('accuracy_score test data;', accuracy_test)